# print() 함수
# 화면에 출력하고 줄바꿈(new line) 수행

#숫자: 100, 3.14 ...
#     소숫점이 없으면 '정수(integer)'   있으면  '실수(float)'
#     숫자는 산술연산 가능 ( +, - , * , / ...)
#문자(String, str):  " ~~"  혹은 ' ~~ '  혹은 """ ~~~ """ 혹은 ''' ~ ''' 
print(type(100))
# 100 + 20   # 프로그램 내에서는 '값'은 아무런 동작 안한다.

# 파이썬에서는 나눗셈 연산의 결과는 언.제.나 '실수(float)' 다!!!

# 파이썬에서는 나눗셈후 소숫점 이하를 버리는 연산자 있다!
#     //
#   정수끼리 딱 떨어지는 나눗셈 결과에 대해서는 정수로 결과 나옴

#  120 // 2.0  <-- 피연산자중 하나라도 실수가 있으면 결과는 실수

# 나머지 연산자 %

# 제곱 연산자   **

#-------------------------------------------------------

# He says "Hi!"

# She's Gone

# He says "I'm so tired"

# """ ~ """ 여러줄 주석으로 사용되기도 함.

"""
    이 안에 있는 내용들은
    여러줄 주석으로 처리 됩니다.
"""

# 문자열 연산
#   + 연산: 문자열 끼리의 연결 연산 수행

# 절대로 문자와 숫자는 +  연산 할수 없다!

#  * 연산 :
print("-" * 40)

# 문자열의 길이 (legnth) : 문자열 안의 문자의 개수
# len() 함수 사용

# 문자열 인덱싱(indexing) , 슬라이싱 (slicing)









